In [4]:
import pandas as pd
import numpy as np

In [4]:
list  = np.arange(3)

In [5]:
list

array([0, 1, 2])

In [6]:
sr1 = pd.Series(list)

In [7]:
sr1

0    0
1    1
2    2
dtype: int32

In [8]:
sr2 = pd.Series(np.arange(3,10))

In [9]:
sr2

0    3
1    4
2    5
3    6
4    7
5    8
6    9
dtype: int32

In [12]:
print(sr1,sr2,)

0    0
1    1
2    2
dtype: int32 0    3
1    4
2    5
3    6
4    7
5    8
6    9
dtype: int32

In [1]:
pd.read_csv('student.csv')

NameError: name 'pd' is not defined

In [5]:
df =  pd.read_csv('student.csv')

In [6]:
df

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,0,80
2,1003,10,3,8,2,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

In [7]:
df.columns

Index(['Student ID', 'Class', 'Study hrs', 'Sleeping hrs',
       'Social Media usage hrs', 'Mobile Games hrs', 'Percantege'],
      dtype='object')

In [8]:
pd.read_csv('student.csv',nrows=2)

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,0,80

In [10]:
pd.read_csv('student.csv',usecols=[1,2,3])

   Class  Study hrs  Sleeping hrs
0     10          2             9
1     10          6             8
2     10          3             8
3     11          0            10
4     11          4             7
5     11         10             7
6     12          4             6
7     12         10             6
8     12          2             8
9     12          6             9

In [11]:
pd.read_csv('student.csv',skiprows = 1)

   1001  10   2   9  3  5  50
0  1002  10   6   8  2  0  80
1  1003  10   3   8  2  4  60
2  1004  11   0  10  1  5  45
3  1005  11   4   7  2  0  75
4  1006  11  10   7  0  0  96
5  1007  12   4   6  0  0  80
6  1008  12  10   6  2  0  90
7  1009  12   2   8  2  4  60
8  1010  12   6   9  1  0  85

In [21]:
df = pd.read_csv('student.csv',index_col = 0)

In [22]:
df

,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
Student ID,,,,,,
1001,10,2,9,3,5,50
1002,10,6,8,2,0,80
1003,10,3,8,2,4,60
1004,11,0,10,1,5,45
1005,11,4,7,2,0,75
1006,11,10,7,0,0,96
1007,12,4,6,0,0,80
1008,12,10,6,2,0,90
1009,12,2,8,2,4,60
1010,12,6,9,1,0,85

In [5]:
df1 = pd.read_csv('student_result1.csv')
df1

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

In [17]:
gr1 = df1.groupby(by = 'Section')
gr1

In [11]:
gr1.groups

{'A': [0, 2], 'B': [1], 'C': [3, 4]}

In [12]:
df1.groupby(['Section', 'Class']).groups

{('A', 10): [0, 2], ('B', 10): [1], ('C', 11): [3], ('C', 12): [4]}

In [13]:
list(gr1)

[('A',
     Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
  0        1001       A     10          2                       3          50
  2        1003       A     10          3                       2          60),
 ('B',
     Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
  1        1002       B     10          6                       2          80),
 ('C',
     Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
  3        1004       C     11          0                       1          45
  4        1005       C     12          5                       2          75)]

In [15]:
gr3 = df1.groupby('Class').get_group(10)
gr3

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60

In [18]:
gr1.sum()

         Student ID  Class  Study hrs  Social Media usage hrs  Percentage
Section
A              2004     20          5                       5         110
B              1002     10          6                       2          80
C              2009     23          5                       3         120

In [19]:
gr1.describe()

        Student ID                                                      \
             count    mean       std     min      25%     50%      75%
Section
A              2.0  1002.0  1.414214  1001.0  1001.50  1002.0  1002.50
B              1.0  1002.0       NaN  1002.0  1002.00  1002.0  1002.00
C              2.0  1004.5  0.707107  1004.0  1004.25  1004.5  1004.75

                Class        ... Social Media usage hrs      Percentage        \
            max count  mean  ...                    75%  max      count  mean
Section                      ...
A        1003.0   2.0  10.0  ...                   2.75  3.0        2.0  55.0
B        1002.0   1.0  10.0  ...                   2.00  2.0        1.0  80.0
C        1005.0   2.0  11.5  ...                   1.75  2.0        2.0  60.0


               std   min   25%   50%   75%   max
Section
A         7.071068  50.0  52.5  55.0  57.5  60.0
B              NaN  80.0  80.0  80.0  80.0  80.0
C        21.213203  45.0  52.5  60.0  67.5  75.0

[3 rows x 40 columns]

In [21]:
gr1.mean()

         Student ID  Class  Study hrs  Social Media usage hrs  Percentage
Section
A            1002.0   10.0        2.5                     2.5        55.0
B            1002.0   10.0        6.0                     2.0        80.0
C            1004.5   11.5        2.5                     1.5        60.0

In [22]:
gr1.agg(['sum', 'max', 'mean'])

        Student ID               Class           Study hrs           \
               sum   max    mean   sum max  mean       sum max mean
Section
A             2004  1003  1002.0    20  10  10.0         5   3  2.5
B             1002  1002  1002.0    10  10  10.0         6   6  6.0
C             2009  1005  1004.5    23  12  11.5         5   5  2.5

        Social Media usage hrs          Percentage
                           sum max mean        sum max  mean
Section
A                            5   3  2.5        110  60  55.0
B                            2   2  2.0         80  80  80.0
C                            3   2  1.5        120  75  60.0

In [23]:
df11 = pd.DataFrame({'A': [1,2,3],
                   'B': [10,20,30]})
 
df12 = pd.DataFrame({'C': [4,5,6],
                   'D': [40,50,60]})

In [25]:
display(df11, df12)

   A   B
0  1  10
1  2  20
2  3  30

   C   D
0  4  40
1  5  50
2  6  60

In [26]:
df11.join(df12)

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [28]:
df12.join(df11)

   C   D  A   B
0  4  40  1  10
1  5  50  2  20
2  6  60  3  30

In [29]:
df11.join(df12, how = 'right')

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [30]:
df11.join(df12, how = 'inner')

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [31]:
df11.join(df12, how = 'outer')

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [32]:
df21 = pd.DataFrame({'A': [1,2,3],
                   'B': [10,20,30]},
                   index = ['a','b','c'])
 
df22 = pd.DataFrame({'C': [4,5],
                   'D': [40,50]},
                  index = ['a','b'])

In [33]:
df21.join(df22, how = 'right')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [35]:
df21.join(df22, how = 'inner')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [36]:
df21.join(df22, how = 'outer')

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN